/*
Помогите пожалуйста с кодом этой задачи:
Сухробу на день рождения подарили n кубиков. Он с друзьями решил построить из них пирамиду.
Сухроб хочет построить пирамиду следующим образом: на верхушке пирамиды должен находиться 1 кубик,
на втором уровне 1+2=3 кубика, на третьем 1+2+3=6 кубиков, и так далее. Таким образом, на i-м уровне пирамиды
должно располагаться 1+2+...+(i-1)+i кубиков.
Сухроб хочет узнать, пирамиду какой максимальной высоты он может создать с использованием имеющихся кубиков.

Входные данные
В первой строке записано целое число n (1 <= n >= 104) — количество кубиков, подаренных Сухробу.

Выходные данные
Выведите единственной строкой максимально возможную высоту пирамиды.
*/

print("Enter your number: ")

var n = readLine()!!.toInt()
var height = 0
var inlayer = 1

while (inlayer <= n) {
	height += 1
	n -= inlayer
	inlayer += 1
}

println("The height of the pyramid: $height")

val amplitudes = listOf(1,2,3,4,3,2,1)
val max = amplitudes.maxOrNull() ?: 0

fun findMin(list: List<Int>): Int? {
    var min = Int.MAX_VALUE
    for (i in list) {
        min = min.coerceAtMost(i)
    }
    return min
}
 
fun findMax(list: List<Int>): Int? {
    var max = Int.MIN_VALUE
    for (i in list) {
        max = max.coerceAtLeast(i)
    }
    return max
}
 
fun main() {
    val list = listOf(10, 4, 2, 7, 6, 9)
 
    val min = findMin(list)
    println(min)            // 2
 
    val max = findMax(list)
    println(max)            // 10
}


/*
println("Input your first name:")
var firstName = readLine()
println("How are you, $firstName?")
*/
/*
println("Enter two numbers separated by space.")
val (a, b) = readLine()!!.split(' ').map(String::toInt)
println("$a + $b = ${a+b}")
*/
/*
print("Enter your number: ")
val n = readLine()!!.toInt()
println("Your number is $n")
*/
/*
Помогите пожалуйста с кодом этой задачи:
Сухробу на день рождения подарили n кубиков. Он с друзьями решил построить из них пирамиду.
Сухроб хочет построить пирамиду следующим образом: на верхушке пирамиды должен находиться 1 кубик,
на втором уровне 1+2=3 кубика, на третьем 1+2+3=6 кубиков, и так далее. Таким образом, на i-м уровне пирамиды
должно располагаться 1+2+...+(i-1)+i кубиков.
Сухроб хочет узнать, пирамиду какой максимальной высоты он может создать с использованием имеющихся кубиков.

Входные данные
В первой строке записано целое число n (1 <= n >= 104) — количество кубиков, подаренных Сухробу.

Выходные данные
Выведите единственной строкой максимально возможную высоту пирамиды.
*/
// (0..10).random()